{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1], "name": "input_1"}}, {"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1], "name": "input_2"}}, {"class_name": "Add", "name": "add", "inbound_nodes": [[["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add"}}], "output_layers": [["add", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model"}, "keras_version": "2.2.4-tf"}